app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO "customers" ("name", "rfc", "telephone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "axel"], ["rfc", "gomj930126hmcnrl08"], ["telephone_number", "7222062556"], ["created_at", "2022-06-21 02:15:16.145313"], ["updated_at", "2022-06-21 02:15:16.145313"]]