app/controllers/welcome_controller.rb

  def home
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"